#include "stdafx.h"

#include "UI.h"

#include <stdio.h>

//#include "Objects.h"
#include "Dispatch.h"
#include "CSB.h"
#include "Data.h"

#ifdef _MSVC_CE2002ARM
extern bool hidingMenu;
#endif

extern unsigned char *encipheredDataFile;
extern bool simpleEncipher;
extern bool RecordDesignOption;
extern bool DMRulesDesignOption;
extern bool invisibleMonsters;
extern bool DM_rules;
extern bool drawAsSize4Monsters;
extern bool RecordCommandOption;
extern bool NoRecordCommandOption;
extern bool RecordMenuOption;
extern bool NoRecordMenuOption;
extern bool extendedPortraits;
extern bool sequencedTimers;
extern bool extendedTimers;
extern bool DefaultDirectXOption;
extern i32 deleteDuplicateTimers;
extern bool extendedWallDecorations;
extern bool disableSaves;
extern i32 dbEntrySizes[16];
extern char hintKey[8];
extern OVERLAYDATA currentOverlay;
extern bool overlayActive;
extern i32 numGlobalVariables;
extern ui32 *globalVariables;
extern ui8 overlayPaletteRed[512];
extern ui8 overlayPaletteGreen[512];
extern ui8 overlayPaletteBlue[512];
void RC4_prepare_key(unsigned char *, i32);
void RC4_encipher(unsigned char *buffer_ptr,
                  i32 buffer_len,
                  i32 position);
void info(char *, unsigned int);
void SelectOverlay(i32, i32, i32, i32, i32);
i32 LoadLong(pnt addr);
void RecordFile_Record(const char *line);
void RecordFile_Record(i32 x, i32 y, i32 z);
void RecordFile_Record(MouseQueueEnt *MQ);
bool IsPlayFileOpen();
bool PlayFile_Play(MouseQueueEnt *MQ);
bool IsRecordFileRecording();
void RecordFile_Open();
void RecordFile_Close();

struct GAMEBLOCK1
{
   // Data below this line is 512 bytes long.  This
   // block is the first read from the game save file.
   // IN original code...starts at -740(A6)
   i8 Byte740[300];       //000
   i8 Byte22598;          //300
   ui8 Byte22596;         //301
   i8 FILL438[4];         //302
   i16 SaveOption;        //306
   i32 RandomGameID;      //308;// reversed//
   i16 Block2Hash;        //312 swapped
   i16 ITEM16Hash;        //314 swapped
   i16 CharacterHash;     //316 swapped
   i16 TimersHash;        //318 swapped
   i16 TimerQueHash;      //320 swapped
   i32 totalMoveCount;    //322
   i16 Hash326;           //326
   i16 Hash328;           //328
   i16 Hash330;           //330
   i16 Hash332;           //332
   i16 Hash334;           //334
   i16 Hash336;           //336
   i16 Hash338;           //338
   i16 Hash340;           //340
   i16 Hash342;           //342
   i16 Block2Checksum;    //344swapped
   i16 ITEM16Checksum;    //346 swapped
   i16 CharacterChecksum; //348 swapped
   i16 TimersChecksum;    //350 swapped
   i16 TimerQueChecksum;  //352 swapped
   i16 Checksum354;       //354
   i16 Checksum356;       //356
   i16 Checksum358;       //358
   i16 Checksum360;       //360
   i16 Checksum362;       //362
   i16 Checksum364;       //364
   i16 Checksum366;       //366
   i16 Checksum368;       //368
   i16 Checksum370;       //370
   i16 Checksum372;       //372
   i16 Checksum374;       //374
   i16 Word22594;         //376 swapped
   i16 Word22592;         //378 swapped
   i8 Byte22808[132];     //380 moved as a unit
};

struct GAMEBLOCK2
{
   // The following 128 bytes are the second thing
   // read from the game file.
   i32 Time;                  //000;  reversed
   i32 ranseed;               //004; reversed
   ui16 ObjectInHand;         //008; swapped
   i16 numcharacter;          //010; swapped
   i16 partyx;                //012; swapped
   i16 partyy;                //014; swapped
   i16 partyfacing;           //016; swapped
   i16 partyLevel;            //018; swapped
   i16 handChar;              //020; swapped Character index
   i16 MagicCaster;           //022; swapped
   i16 NumTimer;              //024; swapped
   i16 FirstAvailTimer;       //026; swapped
   i16 MaxTimers;             //028; swapped
   i16 ITEM16QueLen;          //030; swapped
   i32 LastMonsterAttackTime; //032; reversed
