#include "stdafx.h"
#include "UI.h"
#include "Objects.h"
#include "Dispatch.h"
#include "CSB.h"
#if 0
#include "Transition.h"

#include <string.h>
//#include <TextUtils.h>




#define	A0B(x)	( (unsigned char*)A0)[x]
#define	A0W(x)	((unsigned short*)(((unsigned char*)A0)+x))[0]
#define	A0L(x)	((unsigned long*)(((unsigned char*)A0)+x))[0]

#define	A1B(x)	( (unsigned char*)A1)[x]
#define	A1W(x)	((unsigned short*)(((unsigned char*)A1)+x))[0]
#define	A1L(x)	((unsigned long*)(((unsigned char*)A1)+x))[0]


#define	A5B(x)	( (unsigned char*)A5)[x]
#define	A5W(x)	((unsigned short*)(((unsigned char*)A5)+x))[0]
#define	A5L(x)	((unsigned long*)(((unsigned char*)A5)+x))[0]

#define	A6B(x)	( (unsigned char*)A6)[x]
#define	A6W(x)	((unsigned short*)(((unsigned char*)A6)+x))[0]
#define	A6L(x)	((unsigned long*)(((unsigned char*)A6)+x))[0]


static unsigned char 	sectors3_3 [1536] = {0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,
0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,
0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,
0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,

0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,
0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,
0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,
0x00,0x00};

static	char	bootsector[512] = {0x60,0x38,0x4C,0x6F,0x61,0x64,0x65,0x72,0x00,0x00,0x00,0x00,0x02,0x02,0x01,0x00,0x02,0x10,0x00,0x24,0x03,0xF8,0x02,0x00,0x0A,0x00,
0x01,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x04,0x00,0x00,0x00,0x00,0x00,0x00,0x53,0x57,0x4F,0x4F,0x53,0x48,
0x20,0x20,0x49,0x4D,0x47,0x00,0x70,0x07,0x32,0x3C,0x07,0x77,0x48,0xE7,0xC0,0x00,0x3F,0x3C,0x00,0x25,0x4E,0x4E,0x54,0x8F,0x4C,0xDF,
0x00,0x03,0x20,0x7C,0xFF,0xFF,0x82,0x40,0x30,0x81,0x04,0x41,0x01,0x11,0x51,0xC8,0xFF,0xE2,0x20,0x7C,0xFF,0xFF,0x82,0x40,0x70,0x0F,
0x42,0x58,0x51,0xC8,0xFF,0xFC,0x33,0xFA,0xFF,0xAE,0x00,0x00,0x04,0x82,0x3F,0x39,0x00,0x00,0x04,0x46,0x3F,0x3C,0x00,0x07,0x4E,0x4D,
0x58,0x4F,0x4A,0x80,0x67,0x00,0x00,0xF6,0x2A,0x40,0x41,0xFA,0xFF,0x9C,0x4A,0x90,0x66,0x06,0x20,0xB9,0x00,0x00,0x04,0x32,0x30,0x2D,
0x00,0x08,0xE1,0x48,0xD0,0x80,0x38,0x40,0xD9,0xFA,0xFF,0x84,0x30,0x3A,0xFF,0x76,0x67,0x10,0x3C,0x3A,0xFF,0x72,0x38,0x3A,0xFF,0x70,
0x26,0x7A,0xFF,0x6E,0x60,0x00,0x00,0xB4,0x3C,0x2D,0x00,0x0A,0x38,0x2D,0x00,0x08,0xD8,0x6D,0x00,0x06,0x26,0x7A,0xFF,0x5E,0x61,0x00,
0x00,0xB0,0x66,0x00,0x00,0xAA,0x20,0x4C,0x30,0x2D,0x00,0x06,0xE1,0x48,0xE3,0x48,0x41,0xF0,0x00,0x00,0x43,0xFA,0xFF,0x48,0x90,0xFC,
0x00,0x20,0xB1,0xCC,0x6D,0x00,0x00,0x8E,0x70,0x0A,0x12,0x30,0x00,0x00,0xB2,0x31,0x00,0x00,0x66,0xEA,0x51,0xC8,0xFF,0xF4,0x7E,0x00,
0x1E,0x28,0x00,0x1B,0xE1,0x4F,0x1E,0x28,0x00,0x1A,0x2C,0x7A,0xFF,0x1A,0x26,0x7A,0xFF,0x12,0x42,0x84,0x0C,0x47,0x0F,0xF0,0x6C,0x52,
0x36,0x07,0x55,0x43,0xC6,0xED,0x00,0x02,0xD6,0x6D,0x00,0x0C,0x0C,0x44,0x00,0x40,0x6C,0x08,0x4A,0x44,0x67,0x0E,0xB6,0x45,0x67,0x10,
0x61,0x46,0x66,0x42,0xE1,0x8C,0xE3,0x8C,0xD7,0xC4,0x3C,0x03,0x3A,0x03,0x42,0x84,0xD8,0x6D,0x00,0x02,0xDA,0x6D,0x00,0x02,0x34,0x07,
0xE2,0x4A,0xD4,0x47,0x12,0x36,0x20,0x01,0xE1,0x49,0x12,0x36,0x20,0x00,0x08,0x07,0x00,0x00,0x67,0x02,0xE8,0x49,0x02,0x41,0x0F,0xFF,
0x3E,0x01,0x60,0xA8,0x4A,0x44,0x67,0x04,0x61,0x0A,0x66,0x06,0x2F,0x3A,0xFE,0xAC,0x4E,0x75,0x60,0xFE,0x3F,0x39,0x00,0x00,0x04,0x46,
0x3F,0x06,0x3F,0x04,0x2F,0x0B,0x42,0x67,0x3F,0x3C,0x00,0x04,0x4E,0x4D,0xDE,0xFC,0x00,0x0E,0x4A,0x40,0x4E,0x75,0x00,0x00,0x00,0x00,
0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,
0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,
0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,
0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x24,0x7D};

struct bpb 
{
        WORD    recsiz;         // sector size in bytes //
        WORD    clsiz;          // cluster size in sectors //
        WORD    clsizb;         // cluster size in bytes //
        WORD    rdlen;          // root directory length in records //
        WORD    fsiz;             // fat size in records //
        WORD    fatrec;         // first fat record (of last fat) //
        WORD    datrec;         // first data record //
        WORD    numcl;          // number of data clusters available //
        WORD    b_flags;
};

static struct flop_info {
  WORD cur_track;
  WORD rate;
  WORD spt;          // number of sectors per track //
  WORD sides;        // number of sides, or -1 if geometry not inited //
  BYTE serial[3];    // the serial number taken from the bootsector //
  BYTE wp;           // != 0 means write protected //
} finfo[2];


static struct bpb flop_bpb[2];


struct bs {
  /*   0 */  UBYTE bra[2];
  /*   2 */  UBYTE loader[6];
  /*   8 */  UBYTE serial[3];
  /*   b */  UBYTE bps[2];    // bytes per sector */
  /*   d */  UBYTE spc;       // sectors per cluster */
  /*   e */  UBYTE res[2];    // number of reserved sectors */
  /*  10 */  UBYTE fat;       // number of FATs */
  /*  11 */  UBYTE dir[2];    // number of DIR root entries */
  /*  13 */  UBYTE sec[2];    // total number of sectors */
  /*  15 */  UBYTE media;     // media descriptor */
  /*  16 */  UBYTE spf[2];    // sectors per FAT */
  /*  18 */  UBYTE spt[2];    // sectors per track */
  /*  1a */  UBYTE sides[2];  // number of sides */
  /*  1c */  UBYTE hid[2];    // number of hidden sectors */
  /*  1e */  UBYTE data[0x1e0];
  /* 1fe */  UBYTE cksum[2];
};

typedef struct bpb BPB;
static char				memory[8192]={'m','e','m','o','r','y',0,};

static unsigned char  	_bsdata[] = {	/*0xA10*/0x00,0x00,
										/*0xA12*/0x00,0x00,0x00,0x00,
										/*0xA16*/0x00,0x04,0x00,0x00,
										/*0xA1A*/0x00,0x00,0x00,0x00,
										/*0xA1E*/'S','W','O','O','S','H',' ',' ','I','M','G',0x00};

static unsigned short*  A10=(unsigned short*)&_bsdata[0];
static unsigned short*  A12=(unsigned short*)&_bsdata[2];
static unsigned short*  A14=(unsigned short*)&_bsdata[4];
static unsigned long*  	A16=(unsigned long*)&_bsdata[6];
static unsigned long*  	A1A=(unsigned long*)&_bsdata[10];
static unsigned char*	A1E=&_bsdata[14];
static long				_432 = (long)memory;

i32 _0DD78B70(i16,i16,i32);
void A16LDCode();


/*

 0- 1	bra
 2- 7 	loader
 8- a 	serial number
 b- c 	bytes per sector
 d 	  	sectors per cluster
 e- f 	number of reserved sectors
10		number of fatek
11-12	number of root dir entries
13-14	total number of sectors
